       IDENTIFICATION DIVISION.
       PROGRAM-ID.  INVENTORY.
       AUTHOR.  ANDY CARLSON.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       SELECT PRINT-FILE ASSIGN TO PRINTER "LPT1:".

       SELECT UNFORMATED-FILE ASSIGN TO "PRG04.DAT"
                            ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD UNFORMATED-FILE.
       01 UNFORMATED-RECORD.
           03 ITEM-RR          PIC X(15).
           03 QUANTITY-RR      PIC 9(6).

       FD PRINT-FILE.
       01 PRINT-RECORD         PIC X(35).

       WORKING-STORAGE SECTION.

       01 EOF-ERROR            PIC X(3) VALUE SPACE.

       01 TOP-LINE.
           03                  PIC X(14) VALUE "ANDY'S PROGRAM".

       01 HEADING-LINE.
           03                  PIC X(15) VALUE "ITEM".
           03                  PIC X(4) VALUE SPACE.
           03                  PIC X(8) VALUE "QUANTITY".
       01 DETAIL-INFO-LINE.
           03 ITEM-DIL         PIC X(15).
           03                  PIC X(4) VALUE SPACE.
           03 QUANTITY-DIL     PIC ZZZ,ZZ9.

       01 GRAND-TOTAL          PIC 9(6) VALUE ZERO.

       01 SUMMARY-END-LINE.
           03                  PIC X(15) VALUE "GRAND TOTAL".
           03                  PIC X(4) VALUE SPACE.
           03 GRAND-TOTAL-SEL  PIC ZZZ,ZZ9.

       PROCEDURE DIVISION.
       1000-MAIN-LOGIC.
         OPEN INPUT UNFORMATED-FILE.
         OPEN OUTPUT PRINT-FILE.
         PERFORM 2000-WRITE-HEADING-LINE.
         READ UNFORMATED-FILE
               AT END MOVE "YES" TO EOF-ERROR
         END-READ.
         PERFORM 3000-WRITE-DETAIL-INFO
           UNTIL EOF-ERROR = "YES".
         PERFORM 4000-WRITE-SUMMARY-LINE.
         CLOSE UNFORMATED-FILE
         CLOSE PRINT-FILE.
         STOP RUN.

       2000-WRITE-HEADING-LINE.
         MOVE TOP-LINE TO PRINT-RECORD.
         WRITE PRINT-RECORD AFTER ADVANCING PAGE.
         MOVE HEADING-LINE TO PRINT-RECORD.
         WRITE PRINT-RECORD AFTER ADVANCING 2.

       3000-WRITE-DETAIL-INFO.
         ADD QUANTITY-RR TO GRAND-TOTAL.
         MOVE ITEM-RR TO ITEM-DIL.
         MOVE QUANTITY-RR TO QUANTITY-DIL.
         MOVE DETAIL-INFO-LINE TO PRINT-RECORD.
         WRITE PRINT-RECORD AFTER ADVANCING 1.
         READ UNFORMATED-FILE
               AT END MOVE "YES" TO EOF-ERROR
         END-READ.

       4000-WRITE-SUMMARY-LINE.
         MOVE GRAND-TOTAL TO GRAND-TOTAL-SEL.
         MOVE SUMMARY-END-LINE TO PRINT-RECORD.
         WRITE PRINT-RECORD AFTER ADVANCING 2.
